[
  {
    "id": 1,
    "role": "Desenvolvedor Frontend React Pleno",
    "company": "Hubert Administração de Condomínios e Imóveis",
    "date": "2023 – Atual",
    "description": "Desenvolvimento de projetos com foco em tecnologias de ponta, tais como React/Next, Angular 11 e React Native, integrando com eficiência APIs REST e empregando StyledComponents, HTML, CSS, NPM e GIT. Liderança em meetups voltados para testes unitários e gerenciamento eficaz de projetos no ambiente Azure. Destaque para a criação de templates dinâmicos para websites, seguindo metodologia ágil com Scrum e Azure Boards. O projeto inclui suporte para múltiplos idiomas, utilizando i18n para garantir acessibilidade global.",
    "techs": [
      "Javascript",
      "TypeScript",
      "Next.js",
      "React",
      "React Native",
      "Storybook",
      "Jest",
      "Cypress",
      "Scrum"
    ]
  },

  {
    "id": 2,
    "role": "Analista de Desenvolvimento Pleno",
    "company": "i476",
    "date": "2021 – Nov 2022 ",
    "description": "Desenvolvimento de projetos utilizando Angular 11, SASS, HTML, CSS, YARN, JIRA e GIT, com integração de API Rest. Destaque para criação de dashboard com gráficos e templates dinâmicos para o site, adaptados aos dados da API Rest. Utilização do sistema operacional Ubuntu. Metodologia ágil Scrum, gerenciamento de tarefas com Trello e Jira. Liderança no desenvolvimento do aplicativo financeiro de uma empresa parceira em React Native, aplicando StyleSheet, ThemeProvider, Redux, Hooks e Clean Code.",
    "techs": [
      "HTML e SCSS",
      "Javascript",
      "TypeScript",
      "Angular",
      "React Native",
      "anyChart: Maps",
      "anyChart: Stock",
      "Scrum"
    ]
  },

  {
    "id": 3,
    "role": "Desenvolvedor web Frontend Angular",
    "company": "Simplifica Fretes",
    "date": "2020 – Jul 2021 ",
    "description": "Desenvolvimento de projetos na startup com Angular (versão 5.4), SASS, HTML, CSS, YARN, BITBUCKET e GIT, integrados a APIs REST. Atuo na manutenção do servidor de hospedagem e na realização de testes e deploy da aplicação em produção. Destaco a criação de um dashboard com gráficos, uma plataforma de assinatura e novos templates dinâmicos para o site, adaptados aos dados da API Rest. Utilizo Ubuntu como sistema operacional e implemento o método ágil Scrum, com divisão de tarefas via Trello em sprints de duas semanas. Também introduzi o Scrum na empresa e implementei WebSocket para aplicações em tempo real.",
    "techs": [
      "HTML e SCSS",
      "Javascript",
      "TypeScript",
      "Angular",
      "WebSocket",
      "anyChart",
      "Scrum"
    ]
  },

  {
    "id": 4,
    "role": "Desenvolvedor web Frontend Vue.js",
    "company": "Wizzer Imóveis",
    "date": "2019 – Fev 2020",
    "description": "Desenvolvimento de projetos na startup, utilizando Vue.js, SASS, HTML, CSS, YARN e GIT. Responsável pela criação de layouts e participação em meetups da equipe para discutir sobre Vue.js. Reportando-se ao proprietário da empresa, fornecendo informações sobre as atividades realizadas.",
    "techs": ["HTML e SCSS", "Javascript", "Vue.js"]
  }
]
